

{
    "company": "iPipeline",
    "jobtitle": "Associate Developer",
    "about": "We are currently looking for an Associate Developer to join a collaborative Professional Services team. As a developer in the Professional Services department, you will be responsible for working closely with your project team to deliver against business requirements for your assigned customer(s). The ability to work in a fast-paced Agile environment through development, testing, and delivery is critical to success in this role. The ideal candidate will have strong communication skills, the ability to multi-task, be dedicated to detail and quality, and foster an open work environment.",
    "responsibilities": 
    [
        "Collaborate with internal teams to design and develop efficient web applications",
        "Participate in requirements analysis and estimation to understand deliverables and strategy",
        "Collaborate with internal teams to design and develop optimal software solutions",
        "Maintain, update, refactor and debug code",
        "Write clean, scalable code using JavaScript and .NET programming languages in adherence with iPipeline development standards and security policies",
        "UI design, development, and unit testing using iPipeline proprietary tools",
        "Create/maintain XML configuration files",
        "Source control management using TFS for project setup and deployments",
        "Create and maintain documentation",
        "Support of evening and/or weekend deployments may be required." 
     ],
     "skillrequirements" : 
     [ 
         "Attention to detail & quality", 
        "Ability to organize and prioritize multiple tasks within tight timelines and budget constraints",
        "Ability to collaborate with co-workers and customers in a fast-paced environment",
        "Strong communication and troubleshooting skills",
        "Analytical skills to comprehend requirements and make recommendations for design improvements",
        "Familiarity/experience with AGILE methodology",
        "0-3 years of relevant experience"
     ],
     "technicalknowledgerequirements" : [
        "Adequate knowledge of object-oriented programming",
        "Proven experience working with .NET (C# or VB) web applications and debuggers",
        "Knowledge of JavaScript and JSON",
        "Experience working with XML and XSLT",
        "Basic understanding of database design and querying in SQL Server",
        "NET Web Services experience a plus",
        "Basic understanding of Insurance Industry and Products a plus"

     ],

     "senioritylevel": "Entry Level",
     "employmenttype": "Full-time",
     "industry": "Information Technology & Services  Computer Software  Financial Services"
    }